app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
    @pictures = Picture.all

INSERT INTO "pictures" ("upimg", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["upimg", "Foto1_AcaiEnPolvo.jpg"], ["product_id", 1], ["created_at", "2016-05-16 19:12:17.846363"], ["updated_at", "2016-05-16 19:12:17.846363"]]
---
  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_picture
      @picture = Picture.find(params[:id])